Creating DataFrame

In [1]:
import pandas as pd
d = {'col1': [1, 2, 3, 4, 7], 'col2': [4, 5, 6, 9, 5], 'col3': [7, 8, 12, 1, 2]}
df = pd.DataFrame(data=d)  #DataFrame fun from pandas library
print(df)

   col1  col2  col3
0     1     4     7
1     2     5     8
2     3     6    12
3     4     9     1
4     7     5     2

In [2]:
df.shape  #dimensions of dataframe

(5, 3)

In [3]:
df.shape[0]  #number of rows

5

In [4]:
df.shape[1]  #number of columns

3

In [5]:
rows, cols = df.shape  #same as (r,c) = df.shape

In [6]:
rows

5

In [7]:
cols

3

Access Data from Dataframe

In [8]:
df.head(2)  #shows first two data entry

   col1  col2  col3
0     1     4     7
1     2     5     8

In [9]:
df.tail(2)  #shows last two data entry

   col1  col2  col3
3     4     9     1
4     7     5     2

In [10]:
df[2:4]  #slicing

   col1  col2  col3
2     3     6    12
3     4     9     1

In [11]:
df[:-2]

   col1  col2  col3
0     1     4     7
1     2     5     8
2     3     6    12

In [12]:
df.columns  #shows columns names and type

Index(['col1', 'col2', 'col3'], dtype='object')

In [13]:
df.col2  #shows columns data

0    4
1    5
2    6
3    9
4    5
Name: col2, dtype: int64

In [14]:
df[['col1', 'col2']]

   col1  col2
0     1     4
1     2     5
2     3     6
3     4     9
4     7     5

In [15]:
df['col1'].max()

7

In [16]:
df['col2'].min()

4

In [17]:
df["col1"].mean()

3.4

In [18]:
df.describe()

           col1      col2       col3
count  5.000000  5.000000   5.000000
mean   3.400000  5.800000   6.000000
std    2.302173  1.923538   4.527693
min    1.000000  4.000000   1.000000
25%    2.000000  5.000000   2.000000
50%    3.000000  5.000000   7.000000
75%    4.000000  6.000000   8.000000
max    7.000000  9.000000  12.000000

In [19]:
df[df.col1>2]   #shows data where rows>2

   col1  col2  col3
2     3     6    12
3     4     9     1
4     7     5     2